<b>Answers from :<b/> <a href="https://github.com/spacelover92" style="color:blue;font-size:30px;font-family:Comic Sans MS">Spacelover92(Click to visit my github)</a>

***

#### 1. List of employees who earn more than average salary
##### Note: In this case, we need a sub-quesry because we can't use aggregate function (AVG()) in WHERE clause

###### SQL code:
``` sql
SELECT * FROM employees
		WHERE salary > (SELECT AVG(salary) FROM employees)
```

###### Result:
EMP_ID|F_NAME|L_NAME|SSN|B_DATE|SEX|ADDRESS|JOB_ID|SALARY|MANAGER_ID|DEP_ID
 --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- 
E1001|John|Thomas|123456|1976-01-09|M|5631 Rice, OakPark,IL|100|100000.00|30001|2
E1002|Alice|James|123457|1972-07-31|F|980 Berry ln, Elgin,IL|200|80000.00|30002|5
E1006|Nancy|Allen|123411|1978-02-06|F|111 Green Pl, Elgin,IL|600|90000.00|30001|2

***

#### 2. Compare salary of each employee with average salary
##### Note: In this case, we need a sub-quesry to select columns it called _Column Expressions_

###### SQL code:
``` sql
SELECT emp_id, salary, 
			(SELECT AVG(salary) FROM employees)
						AS AVG_SALARY 
			FROM employees
```

###### Result:

EMP_ID|SALARY|AVG_SALARY
--- | --- | ---
E1001|100000.00|72000.00000000000000000000000
E1002|80000.00|72000.00000000000000000000000
E1003|50000.00|72000.00000000000000000000000
E1004|60000.00|72000.00000000000000000000000
E1005|70000.00|72000.00000000000000000000000
E1006|90000.00|72000.00000000000000000000000
E1007|65000.00|72000.00000000000000000000000
E1008|65000.00|72000.00000000000000000000000
E1009|70000.00|72000.00000000000000000000000
E1010|70000.00|72000.00000000000000000000000

***

#### 3. To select from not sensitive information
##### Note: Sub-queries in FROM clause called _Derived Tables_ or _Table Expressions_

###### SQL code:
``` sql
SELECT * FROM
			(SELECT emp_id, f_name, l_name, dep_id FROM employees) AS EMP4ALL
			
```

###### Result:

EMP_ID|F_NAME|L_NAME|DEP_ID
--- | --- | --- | ---
E1001|John|Thomas|2
E1002|Alice|James|5
E1003|Steve|Wells|5
E1004|Santosh|Kumar|5
E1005|Ahmed|Hussain|2
E1006|Nancy|Allen|2
E1007|Mary|Thomas|7
E1008|Bharath|Gupta|7
E1009|Andrea|Jones|7
E1010|Ann|Jacob|5

***

### Accessing Multiple Tables with Sub-quesries
##### To retrieve only the employees records that correspond to departments in the DEPARTMENTS table

#### 4. To retrieve only the list of employees from a specific location:
* ##### EMPLOYEES table does not contain location information
* ##### Need to get location info from DEPARTMENTS table
<br/>

###### SQL code:
``` sql
SELECT * FROM employees 
				WHERE dep_id IN (SELECT dept_id_dep FROM departments
															WHERE  loc_id = 'L0002')
```

###### Result:

EMP_ID|F_NAME|L_NAME|SSN|B_DATE|SEX|ADDRESS|JOB_ID|SALARY|MANAGER_ID|DEP_ID
--- | --- | --- | --- | --- | --- | --- | --- | --- | --- | ---
E1002|Alice|James|123457|1972-07-31|F|980 Berry ln, Elgin,IL|200|80000.00|30002|5
E1003|Steve|Wells|123458|1980-08-10|M|291 Springs, Gary,IL|300|50000.00|30002|5
E1004|Santosh|Kumar|123459|1985-07-20|M|511 Aurora Av, Aurora,IL|400|60000.00|30004|5
E1010|Ann|Jacob|123415|1982-03-30|F|111 Britany Springs,Elgin,IL|220|70000.00|30004|5

***

#### 5. Retrieve the department ID and name for employees who earn more than $70'000:
<br/>

###### SQL code:
``` sql
SELECT dept_id_dep, dep_name FROM departments
				WHERE dept_id_dep IN
				 (SELECT dep_id FROM employees WHERE salary > 70000)
```

###### Result:

DEPT_ID_DEP|DEP_NAME
--- | ---
2|Architect Group
5|Software Group

***

#### 6. Accessing multiple tables with implicit JOIN
##### Note: We don't explicitly write JOIN clause

###### SQL code:
``` sql
SELECT * FROM employees AS e, departments AS d
		WHERE e.dep_id = d.dept_id_dep
```

###### Result:

EMP_ID|F_NAME|L_NAME|SSN|B_DATE|SEX|ADDRESS|JOB_ID|SALARY|MANAGER_ID|DEP_ID|DEPT_ID_DEP|DEP_NAME|MANAGER_ID|LOC_ID
 --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | ---
E1001|John|Thomas|123456|1976-01-09|M|5631 Rice, OakPark,IL|100|100000.00|30001|2|2|Architect Group|30001|L0001
E1002|Alice|James|123457|1972-07-31|F|980 Berry ln, Elgin,IL|200|80000.00|30002|5|5|Software Group|30002|L0002
E1003|Steve|Wells|123458|1980-08-10|M|291 Springs, Gary,IL|300|50000.00|30002|5|5|Software Group|30002|L0002
E1004|Santosh|Kumar|123459|1985-07-20|M|511 Aurora Av, Aurora,IL|400|60000.00|30002|5|5|Software Group|30002|L0002
E1005|Ahmed|Hussain|123410|1981-01-04|M|216 Oak Tree, Geneva,IL|500|70000.00|30001|2|2|Architect Group|30001|L0001
E1006|Nancy|Allen|123411|1978-02-06|F|111 Green Pl, Elgin,IL|600|90000.00|30001|2|2|Architect Group|30001|L0001
E1007|Mary|Thomas|123412|1975-05-05|F|100 Rose Pl, Gary,IL|650|65000.00|30003|7|7|Design Team|30003|L0003
E1008|Bharath|Gupta|123413|1985-05-06|M|145 Berry Ln, Naperville,IL|660|65000.00|30003|7|7|Design Team|30003|L0003
E1009|Andrea|Jones|123414|1990-07-09|F|120 Fall Creek, Gary,IL|234|70000.00|30003|7|7|Design Team|30003|L0003
E1010|Ann|Jacob|123415|1982-03-30|F|111 Britany Springs,Elgin,IL|220|70000.00|30002|5|5|Software Group|30002|L0002

***

#### 7. To see the department name for each employee
##### Note: For aliasing we can write **employees AS e** or just **employees e** without mentioning **AS**
##### Note2: I just pre-fixed column names in SELECT clause **e** for employees and **d** for departments

###### SQL code:
``` sql
SELECT e.emp_id, d.dep_name FROM employees e, departments d
		WHERE e.dep_id = d.dept_id_dep
```

###### Result:

EMP_ID|DEP_NAME
--- | ---
E1001|Architect Group
E1002|Software Group
E1003|Software Group
E1004|Software Group
E1005|Architect Group
E1006|Architect Group
E1007|Design Team
E1008|Design Team
E1009|Design Team
E1010|Software Group

***

<b>Answers from :<b/> <a href="https://github.com/spacelover92" style="color:blue;font-size:30px;font-family:Comic Sans MS">Spacelover92(Click to visit my github)</a>